tutorials/cylinder3d/system/probes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

probes
{
    type    probes;
    libs    (sampling);

    name    probes;

    writeControl   timeStep;
    writeInterval  1;

    fields
    (
        p
    );

    probeLocations
    (
(   0.50000   0.00000   0.00000)
(   0.49992   0.00873   0.00000)
(   0.49970   0.01745   0.00000)
(   0.49931   0.02617   0.00000)
(   0.49878   0.03488   0.00000)
(   0.49810   0.04358   0.00000)
(   0.49726   0.05226   0.00000)
(   0.49627   0.06093   0.00000)
(   0.49513   0.06959   0.00000)
(   0.49384   0.07822   0.00000)
(   0.49240   0.08682   0.00000)
(   0.49081   0.09540   0.00000)
(   0.48907   0.10396   0.00000)
(   0.48719   0.11248   0.00000)
(   0.48515   0.12096   0.00000)
(   0.48296   0.12941   0.00000)
(   0.48063   0.13782   0.00000)
(   0.47815   0.14619   0.00000)
(   0.47553   0.15451   0.00000)
(   0.47276   0.16278   0.00000)
(   0.46985   0.17101   0.00000)
(   0.46679   0.17918   0.00000)
(   0.46359   0.18730   0.00000)
(   0.46025   0.19537   0.00000)
(   0.45677   0.20337   0.00000)
(   0.45315   0.21131   0.00000)
(   0.44940   0.21919   0.00000)
(   0.44550   0.22700   0.00000)
(   0.44147   0.23474   0.00000)
(   0.43731   0.24240   0.00000)
(   0.43301   0.25000   0.00000)
(   0.42858   0.25752   0.00000)
(   0.42402   0.26496   0.00000)
(   0.41934   0.27232   0.00000)
(   0.41452   0.27960   0.00000)
(   0.40958   0.28679   0.00000)
(   0.40451   0.29389   0.00000)
(   0.39932   0.30091   0.00000)
(   0.39401   0.30783   0.00000)
(   0.38857   0.31466   0.00000)
(   0.38302   0.32139   0.00000)
(   0.37735   0.32803   0.00000)
(   0.37157   0.33457   0.00000)
(   0.36568   0.34100   0.00000)
(   0.35967   0.34733   0.00000)
(   0.35355   0.35355   0.00000)
(   0.34733   0.35967   0.00000)
(   0.34100   0.36568   0.00000)
(   0.33457   0.37157   0.00000)
(   0.32803   0.37735   0.00000)
(   0.32139   0.38302   0.00000)
(   0.31466   0.38857   0.00000)
(   0.30783   0.39401   0.00000)
(   0.30091   0.39932   0.00000)
(   0.29389   0.40451   0.00000)
(   0.28679   0.40958   0.00000)
(   0.27960   0.41452   0.00000)
(   0.27232   0.41934   0.00000)
(   0.26496   0.42402   0.00000)
(   0.25752   0.42858   0.00000)
(   0.25000   0.43301   0.00000)
(   0.24240   0.43731   0.00000)
(   0.23474   0.44147   0.00000)
(   0.22700   0.44550   0.00000)
(   0.21919   0.44940   0.00000)
(   0.21131   0.45315   0.00000)
(   0.20337   0.45677   0.00000)
(   0.19537   0.46025   0.00000)
(   0.18730   0.46359   0.00000)
(   0.17918   0.46679   0.00000)
(   0.17101   0.46985   0.00000)
(   0.16278   0.47276   0.00000)
(   0.15451   0.47553   0.00000)
(   0.14619   0.47815   0.00000)
(   0.13782   0.48063   0.00000)
(   0.12941   0.48296   0.00000)
(   0.12096   0.48515   0.00000)
(   0.11248   0.48719   0.00000)
(   0.10396   0.48907   0.00000)
(   0.09540   0.49081   0.00000)
(   0.08682   0.49240   0.00000)
(   0.07822   0.49384   0.00000)
(   0.06959   0.49513   0.00000)
(   0.06093   0.49627   0.00000)
(   0.05226   0.49726   0.00000)
(   0.04358   0.49810   0.00000)
(   0.03488   0.49878   0.00000)
(   0.02617   0.49931   0.00000)
(   0.01745   0.49970   0.00000)
(   0.00873   0.49992   0.00000)
(   0.00000   0.50000   0.00000)
(  -0.00873   0.49992   0.00000)
(  -0.01745   0.49970   0.00000)
(  -0.02617   0.49931   0.00000)
(  -0.03488   0.49878   0.00000)
(  -0.04358   0.49810   0.00000)
(  -0.05226   0.49726   0.00000)
(  -0.06093   0.49627   0.00000)
(  -0.06959   0.49513   0.00000)
...
    );
}


// ************************************************************************* //
